Pandas is created by Wes McKinney
Full form of pandas in Panel Data
It is the most popular data analysis library form python and it comes with many tools.

Pandas Series

It is built in on top of numpy array.
The differeitationg factor between numpy array and series is that the sereis can have named index. And we can the data directly on named index.

Pandas Datframe

It is a collection of pandas series

In [4]:
import pandas as pd

In [5]:
d = {'jayesh':100,'sam':90,'shreejit':80}
ser = pd.Series(d)
ser

jayesh      100
sam          90
shreejit     80
dtype: int64

In [7]:
ser.jayesh

100

In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
a = randn(4,5)

In [9]:
df = pd.DataFrame(data = a,columns= ['w','x','y','z','a'])

In [10]:
df

          w         x         y         z         a
0 -0.492193 -0.260620 -0.206047 -0.057926 -1.405250
1  0.408718 -1.236619 -1.044922  0.084456  0.840429
2 -1.355411 -0.146116  1.159482 -1.857218 -0.163731
3  1.103279  0.595760 -0.230707 -0.912290  0.877046

In [11]:
df[['a','y']]

          a         y
0 -1.405250 -0.206047
1  0.840429 -1.044922
2 -0.163731  1.159482
3  0.877046 -0.230707

In [12]:
# if we want to add two columns 
df['NEW'] = df.y + df.z

In [14]:
df.drop('NEW',axis= 1)

          w         x         y         z         a
0 -0.492193 -0.260620 -0.206047 -0.057926 -1.405250
1  0.408718 -1.236619 -1.044922  0.084456  0.840429
2 -1.355411 -0.146116  1.159482 -1.857218 -0.163731
3  1.103279  0.595760 -0.230707 -0.912290  0.877046

In [15]:
df

          w         x         y         z         a       NEW
0 -0.492193 -0.260620 -0.206047 -0.057926 -1.405250 -0.263973
1  0.408718 -1.236619 -1.044922  0.084456  0.840429 -0.960466
2 -1.355411 -0.146116  1.159482 -1.857218 -0.163731 -0.697737
3  1.103279  0.595760 -0.230707 -0.912290  0.877046 -1.142998

In [16]:
# if you want to dorp it in real
df.drop('NEW',axis = 1  , inplace = True)

In [23]:
# to assign the index 
df.index = ['a','b','c','d']

In [24]:
df

          w         x         y         z         a
a -0.492193 -0.260620 -0.206047 -0.057926 -1.405250
b  0.408718 -1.236619 -1.044922  0.084456  0.840429
c -1.355411 -0.146116  1.159482 -1.857218 -0.163731
d  1.103279  0.595760 -0.230707 -0.912290  0.877046

In [22]:
df

          w         x         y         z         a
a -0.492193 -0.260620 -0.206047 -0.057926 -1.405250
b  0.408718 -1.236619 -1.044922  0.084456  0.840429
c -1.355411 -0.146116  1.159482 -1.857218 -0.163731
d  1.103279  0.595760 -0.230707 -0.912290  0.877046

In [25]:
# if you want to featch on the basis of index 
df.iloc[2]

w   -1.355411
x   -0.146116
y    1.159482
z   -1.857218
a   -0.163731
Name: c, dtype: float64

In [26]:
# it will only  show those values where cell > 0 else it will show NaN
df[df>0]

          w        x         y         z         a
a       NaN      NaN       NaN       NaN       NaN
b  0.408718      NaN       NaN  0.084456  0.840429
c       NaN      NaN  1.159482       NaN       NaN
d  1.103279  0.59576       NaN       NaN  0.877046

In [27]:
df['w']> 0 # it will return the pandas sereis with boolean values

a    False
b     True
c    False
d     True
Name: w, dtype: bool

In [29]:
df[df['w']>0]['y'].loc['b']

-1.0449224774523058

In [32]:
cond1 = df['w'] > 0
cond2 = df['x'] > 0

Empty DataFrame
Columns: [w, x, y, z, a]
Index: []

In [36]:
# applying or operations on the basis of columns
df[(cond1) | (cond2)]

          w         x         y         z         a
b  0.408718 -1.236619 -1.044922  0.084456  0.840429
d  1.103279  0.595760 -0.230707 -0.912290  0.877046

In [37]:
# appplying and  operations on the basis of columns
df[(cond1) & (cond2)]

Empty DataFrame
Columns: [w, x, y, z, a]
Index: []

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   w       4 non-null      float64
 1   x       4 non-null      float64
 2   y       4 non-null      float64
 3   z       4 non-null      float64
 4   a       4 non-null      float64
dtypes: float64(5)
memory usage: 364.0+ bytes

In [40]:
df.dtypes

w    float64
x    float64
y    float64
z    float64
a    float64
dtype: object

In [42]:
df.describe()

              w         x         y         z         a
count  4.000000  4.000000  4.000000  4.000000  4.000000
mean  -0.083902 -0.261899 -0.080549 -0.685745  0.037124
std    1.070126  0.752566  0.913964  0.896482  1.075725
min   -1.355411 -1.236619 -1.044922 -1.857218 -1.405250
25%   -0.707998 -0.504619 -0.434261 -1.148522 -0.474110
50%   -0.041737 -0.203368 -0.218377 -0.485108  0.338349
75%    0.582359  0.039353  0.135335 -0.022330  0.849583
max    1.103279  0.595760  1.159482  0.084456  0.877046

In [45]:
ser_w = df['w']>0

In [46]:
ser_w.value_counts()

w
False    2
True     2
Name: count, dtype: int64

Pandas Groupby Operations 

This operation involve split , combine, apply
Pandas perform all these operation using simple groupby method
groupby simply means aggregation : taking up multiple values and returning a single value. Let suppose min(), max(), avg().

In [48]:
data = {'company':['GOOG','GOOG','FB','FB','MS','MS'],
        'Person':['SAM','CHARLIE','Amy','Venesaa','Carl','Junstin'],
        'Sales':[1200,230,432,5432,2312,234]}

df = pd.DataFrame(data = data)

In [51]:
df.groupby('company') # it will just return us a groupby object

In [52]:
# iw we want to see maximum sales company wise 
df.groupby('company').max()

          Person  Sales
company
FB       Venesaa   5432
GOOG         SAM   1200
MS       Junstin   2312

In [55]:
df.groupby('company').describe().transpose()

company               FB         GOOG           MS
Sales count     2.000000     2.000000     2.000000
      mean   2932.000000   715.000000  1273.000000
      std    3535.533906   685.893578  1469.367891
      min     432.000000   230.000000   234.000000
      25%    1682.000000   472.500000   753.500000
      50%    2932.000000   715.000000  1273.000000
      75%    4182.000000   957.500000  1792.500000
      max    5432.000000  1200.000000  2312.000000

Operation in Pandas

In [56]:
data = {'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','jkl']}

In [57]:
df = pd.DataFrame(data = data)

In [59]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [60]:
df['col2'].unique()# it will return the unique values in column col2

array([444, 555, 666])

In [62]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [63]:
# select rows where col1 > 2 and col2  == 444
new_df = df[(df['col1']> 2) & (df['col2'] == 444)]

In [64]:
new_df

   col1  col2 col3
3     4   444  jkl

In [65]:
def times_two(number):
    return number * 2

df['col2'].apply(times_two)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64